# Chapter 6

In [1]:
import pandas as pd

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv("examples/ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ["a", "b", "c", "d", "message"]

In [9]:
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
pd.read_csv("examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
result = pd.read_csv("examples/ex5.csv")

In [12]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [14]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [15]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [17]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [18]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

## pandas.read_csv - arguments reference

[Link](https://wesmckinney.com/book/accessing-data#tbl-table_read_csv_function)

In [19]:
pd.options.display.max_rows = 10

In [20]:
result = pd.read_csv("examples/ex6.csv")

In [21]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [22]:
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [23]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [24]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [25]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [26]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [27]:
data = pd.read_csv("examples/ex5.csv")

In [28]:
data.to_csv("examples/out.csv")

In [29]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [30]:
import sys

In [31]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [32]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [33]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [34]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [35]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [36]:
import csv

In [37]:
f = open("examples/ex7.csv")

In [38]:
reader = csv.reader(f)

In [39]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [40]:
f.close()

In [41]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [42]:
header, values = lines[0], lines[1:]

In [43]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [44]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [45]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

[CSV Dialect Arguments](https://wesmckinney.com/book/accessing-data#tbl-table_csv_dialect)

In [46]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

## JSON Data

In [47]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [48]:
import json

In [49]:
result = json.loads(obj)

In [50]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [51]:
asjson = json.dumps(result)

In [52]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [53]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [54]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [55]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [56]:
data = pd.read_json("examples/example.json")

In [57]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [58]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [59]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML - Web Scraping

In [1]:
import pandas as pd

In [2]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [3]:
len(tables)

1

In [4]:
failures = tables[0]

In [5]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [6]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [7]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [8]:
from lxml import objectify

In [9]:
path = "datasets/mta_perf/Performance_MNR.xml"

In [10]:
with open(path) as f:
    parese = objectify.parse(f)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/mta_perf/Performance_MNR.xml'

Lab is missing a folder called datasets, file not in examples folder.  Skipping.

## Binary Data Formats

In [11]:
frame = pd.read_csv("examples/ex1.csv")

In [12]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
frame.to_pickle("examples/frame_pickle")

In [14]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Lab is missing the data for practicing with parquet files, following code will throw error. Skipping

In [15]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

### Excel Files & HDF5

In [16]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 4.6 MB/s eta 0:00:0000:01
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [17]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [18]:
xlsx.sheet_names

['Sheet1']

In [19]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [20]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [22]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [23]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [24]:
frame.to_excel(writer, "Sheet1")

In [25]:
writer.close()

In [26]:
pip install pytables

ERROR: Could not find a version that satisfies the requirement pytables (from versions: none)
ERROR: No matching distribution found for pytables

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [29]:
pip3 install pytables

SyntaxError: invalid syntax (70234932.py, line 1)

In [30]:
pip install tables

Collecting tables
  Downloading tables-3.9.2.tar.gz (4.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4.7/4.7 MB 12.5 MB/s eta 0:00:0000:0100:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... error
  error: subprocess-exited-with-error

  × Getting requirements to build wheel did not run successfully.
  │ exit code: 1
  ╰─> [12 lines of output]
      /var/folders/1b/ykvrss2j11x83bff14t1qwyh0000gp/T/H5close25_oomx4.c:1:10: fatal error: 'H5public.h' file not found
      #include "H5public.h"
               ^~~~~~~~~~~~
      1 error generated.
      cpuinfo failed, assuming no CPU features: 'flags'
      * Using Python 3.12.0 (main, Oct  5 2023, 15:43:35) [Clang 14.0.0 (clang-1400.0.29.202)]
      * Found cython 3.0.6
      * USE_PKGCONFIG: False
      .. ERROR:: Could not find a local HDF5 installation.
         You may need to explicitly state where your local HDF5 headers and
         library can be found by setting the ``HDF5_DIR`` environment
         variable or by using the ``--hdf5`` command-line option.
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
error: subprocess-exited-with-error

× Getting requirements to build wheel did not run successfully.
│ exit code: 1
╰─> See above for output.

note: This error originates from a subprocess, and is likely not a problem with pip.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

See failures above installing from pip. Skipping

## Interacting with Web APIs

In [31]:
pip install requests

Requirement already satisfied: requests in /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/lib/python3.12/site-packages (2.31.0)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/lib/python3.12/site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/lib/python3.12/site-packages (from requests) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/lib/python3.12/site-packages (from requests) (2.0.7)
Requirement already satisfied: certifi>=2017.4.17 in /opt/homebrew/opt/python-certifi/lib/python3.12/site-packages (from requests) (2023.7.22)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [32]:
import requests

In [33]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [34]:
resp = requests.get(url)

In [35]:
resp.raise_for_status()

In [36]:
resp

In [37]:
data = resp.json()

In [38]:
data[0]["title"]

'TST/CLN: Remove getSeriesData/makeObjectSeries/makeDatetimeIndex'

In [39]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [40]:
issues

,number,title,labels,state
0,56241,TST/CLN: Remove getSeriesData/makeObjectSeries...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
1,56240,BUG: calendar day date_range AmbiguousTimeErro...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,56238,BUG: Read CSV on python engine fails with call...,[],open
3,56237,DEPR: Default of observed=False in DataFrame.p...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
4,56236,DEPR: observed=False default for DataFrame.piv...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
5,56235,Table cell styling,[],open
6,56233,BUG: `to_numpy` raise `ValueError: cannot conv...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,56231,BUG: DataFrame([empty EA Series]) returns NAs ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,56230,CoW warning mode: enable chained assignment wa...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
9,56226,BUG: `DataFrame.groupby with axis=1 is depreca...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
10,56223,"BUG: `.loc[:, 'a'] = ` is inplace when assigni...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,56221,BUG: `pd.nlargest` with `keep='all'` does not ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,56220,Switch arrow type for string array to large st...,[],open
13,56218,BUG: `DataFrame.astype` does not suppress exce...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,56215,CoW: Avoid warning for ArrowDtypes when settin...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
15,56214,CoW: Add warning for slicing a Series with a M...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
16,56213,BUG: inconsistency in freq of DatetimeIndex wh...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
17,56212,CoW: Avoid warning in apply for mixed dtype frame,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
18,56211,CoW: Avoid warning if temporary object is a copy,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
19,56207,WEB: Better management of releases,"[{'id': 1508144531, 'node_id': 'MDU6TGFiZWwxNT...",open
20,56204,BUG: Creating a string column on a mask result...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,56203,BUG: expanding dataframe row-wise with single-...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,56197,Adjust tests in json folder for new string option,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
23,56192,Adjust tests in parsers folder for new string ...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
24,56191,Adjust tests in extension folder for new strin...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
25,56190,Adjust tests for apply folder for new string o...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
26,56188,Adjust tests in array folder for new string op...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
27,56187,BUG: value_counts not preserving object dtype,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
28,56184,Adjust tests in root directory for new string ...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
29,56183,BUG: mode not preserving object dtype for stri...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open

## Interacting with DBs

In [41]:
import sqlite3

In [42]:
query = """CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""

In [44]:
con = sqlite3.connect("mydata.sqlite")

In [45]:
con.execute(query)

In [46]:
con.commit()

In [47]:
data = [("Atlanta", "Georgia", 1.25, 6), ("Tallahassee", "Florida", 2.6, 3), ("Sacramento", "California", 1.7, 5)]

In [48]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [49]:
con.executemany(stmt, data)

In [50]:
con.commit()

In [52]:
cursor = con.execute("SELECT * FROM test")

In [53]:
rows = cursor.fetchall()

In [54]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [55]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [56]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [57]:
pip install sqlalchemy

Collecting sqlalchemy
  Obtaining dependency information for sqlalchemy from https://files.pythonhosted.org/packages/5c/e4/f2b196d8779c09c32337ff1e17d6edd57547fe674413b3a82e42a370a65c/SQLAlchemy-2.0.23-cp312-cp312-macosx_11_0_arm64.whl.metadata
  Downloading SQLAlchemy-2.0.23-cp312-cp312-macosx_11_0_arm64.whl.metadata (9.6 kB)
Collecting typing-extensions>=4.2.0 (from sqlalchemy)
  Obtaining dependency information for typing-extensions>=4.2.0 from https://files.pythonhosted.org/packages/24/21/7d397a4b7934ff4028987914ac1044d3b7d52712f30e2ac7a2ae5bc86dd0/typing_extensions-4.8.0-py3-none-any.whl.metadata
  Using cached typing_extensions-4.8.0-py3-none-any.whl.metadata (3.0 kB)
Downloading SQLAlchemy-2.0.23-cp312-cp312-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 10.7 MB/s eta 0:00:00a 0:00:01
Using cached typing_extensions-4.8.0-py3-none-any.whl (31 kB)
Installing collected packages: typing-extensions, sqlalchemy
Successfully installed sqlalchemy-2.0.23 typing-extensions-4.8.0

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.0.8_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [58]:
import sqlalchemy as sqla

In [60]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [61]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5